; -*- eval: (annotate-mode 1); -*-
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/water.css@2/out/water.css" />

******* Handling permission errors
Knowing if a file is readable by the user does not tell us if it is writable, so
=file-readable-p= must be used before or at the same time as =file-writable-p=.

#+begin_src emacs-lisp
  (unless (and (file-writable-p "/root") (file-readable-p "/root"))
    (message "You are not root."))
#+end_src

#+RESULTS:
: You are not root.

The writable predicate returns =nil= if the file cannot be written to by the
user, and the readable predicate returns =nil= if the user cannot read from the
file because of a permission error /or/ the file doesn't exist. To check if the
file exists, and is both readable and writable the two predicates must be used
together: =(and (file-writable-p directory) (file-readable-p directory)=.

Handling more than a few files this way is tedious and prone to error, so
checks for a user or system file tree should be done during initialization, and
take advantage of POSIX, SUS, and SELinux permissions specifications.

Refactoring =load-paths= included a change from simply checking that the
Spacemacs cache directory before creating it to the following.

#+begin_src emacs-lisp
  ;; TODO: Should also catch any IO error such as permission error (Apr 25 2021 Lucius)
  (unless (and (file-readable-p spacemacs-cache-directory)
               (file-writable-p spacemacs-cache-directory))
    (condition-case-unless-debug nil
        (make-directory spacemacs-cache-directory)
      (error nil)))
#+end_src

